Repository: bailerG/academy_projeto_final
Catalog: lib/l10n/app_*.arb
Languages: pt

# language
source: english
pt: portugues

# loginWelcome
source: Welcome
pt: Bem-vindo

# headerUsername
source: Username
pt: Usuário

# headerPassword
source: Password
pt: Senha

# typeUser
source: Type in your Username
pt: Digite seu Usuário

# typePassword
source: Type in your Password
pt: Digite sua Senha

source: Login
pt: Entrar

# emptyUser
source: Please type your username
pt: Digite um usuário

# emptyPassword
source: Please type your password
pt: Digite uma senha

# wrongLogin
source: Username/Password incorrect.
pt: Usuário/Senha Incorretos.

# vehicleTab
source: Add Vehicle
pt: Adicionar Veículo

# salesTab
source: Sales
pt: Vendas

# settingsTab
source: Settings
pt: Opções

# homeWelcome
source: Welcome {username}
pt: Bem-Vindo {username}

# noVehicleInStock
source: There are no vehicles in stock
pt: Não há veículos no estoque

# vehicleRegisterTitle
source: Got a new car in the garage?
pt: Entrou um veículo novo na garagem?

# vehicleRegisterSubtitle
source: Fill with the correct information
pt: Preencha com os dados corretos

# brandHeader
source: Brand
pt: Marca

# modelHeader
source: Model
pt: Modelo

# plateHeader
source: Plate
pt: Placa

# builtYearHeader
source: Built Year
pt: Ano de Fabricação

# modelYearHeader
source: Model Year
pt: Ano Modelo

# priceHeader
source: Price Paid
pt: Preço

# datePurchaseHeader
source: Purchased
pt: Data da Compra

# photoHeader
source: Photo
pt: Foto

# brandEmpty
source: Please inform the vehicle's brand
pt: Por favor digite a marca

# modelEmpty
source: Please inform the vehicle's model
pt: Por favor digite o modelo

# plateEmpty
source: Please inform the vehicle's plate
pt: Por favor digite a placa

# builtYearEmpty
source: Please inform the year the vehicle was built
pt: Por favor informe o ano de fabricação

# onlyNumbers
source: Type only numbers
pt: Digite apneas números

# modelYearEmpty
source: Please inform the model year of the vehicle
pt: Por favor digite o ano modelo

# dateEmpty
source: Please select a date
pt: Por favor selecione uma data

# pickDate
source: Pick a date
pt: Selecione uma datta

# priceEmpty
source: Price can't be zero
pt: O preço não pode ser zero

# choosePhoto
source: Choose
pt: Escolher

source: Take photo
pt: Tirar Foto

source: Update Vehicle
pt: Atualizar Veículo

source: Register Vehicle
pt: Registrar Veículo

source: CAR DETAILS
pt: DETALHES DO VEÍCULO

# editCar
source: Edit
pt: Editar

# deleteCar
source: Delete
pt: Deletar

# alertTitle
source: Are you sure?
pt: Você tem certeza?

# carAlertMessage
source: Do you really want to delete this car?
pt: Você realmente quer deletar esse veículo?

source: Yes
pt: Sim

source: Cancel
pt: Cancelar

# sellButton
source: Sell
pt: Vender

# sellCarTitle
source: Sell Vehicle
pt: Vender veículo

# soldCar
source: Sold!
pt: Vendido!

# nameHeader
source: Name
pt: Nome

source: Date of Sale
pt: Data de Venda

source: Price Sold
pt: Preço Vendido

# cpfEmpty
source: Please write buyer's CPF
pt: Por favor digite o CPF do comprador

# nameEmpty
source: Please write buyer's name
pt: Por favor digite o nome do comprador

# nameHint
source: John Doe
pt: João da Silva

# editUser
source: View and Edit User
pt: Ver e Editar Usuário

# registerUser
source: Register a New Associate
pt: Registrar um Novo Associado

# editDealership
source: View and Edit Dealerships
pt: Ver e Editar Lojas

# registerDealership
source: Register a New Dealership
pt: Registrar Nova Loja

source: Edit Percentages
pt: Editar Porcentagens

# salesList
source: See All Sales
pt: Ver Todas as Vendas

# generateReport
source: Generate a Report
pt: Gerar Relatório

# themeHeader
source: Theme:
pt: Tema:

# languageHeader
source: Language:
pt: Idioma:

# settingsTitle
source: Here you can change your settings
pt: Mude suas opções

# lightTheme
source: Light
pt: Claro

# darkTheme
source: Dark
pt: Escuro

# dealershipTitle
source: New dealership?
pt: Nova Loja?

# editDealershipTitle
source: Edit Existing Dealership
pt: Editar Loja Existente

# dealershipSubtitle
source: Fill the fields below:
pt: Preencha os campos abaixo:

# dealershipNameHeader
source: Name
pt: Nome

# dealershipPasswordHeader
source: Password
pt: Senha

# dealershipAutonomyHeader
source: Autonomy Level
pt: Nível de Autonomia

# dealershipNameHint
source: Dealership Name
pt: Nome da loja

# dealershipNameEmpty
source: Please type a name for the dealership
pt: Por favor digite um nome para a loja

# dealershipCNPJHint
source: Dealership CNPJ
pt: CNPJ da loja

# dealershipCNPJEmpty
source: Please type a CNPJ
pt: Por favor digite um CNPJ

# dealershipCNPJLength
source: CNPJ can only be 14 digits
pt: CNPJ deve ter 14 digitos

# dealershipPasswordEmpty
source: Please generate a password
pt: Por favor gere uma senha

# dealershipPasswordShort
source: Password should be at least 5 characters long
pt: A senha deve conter pelo menos 5 caracteres

source: Generate Password
pt: Gerar Senha

source: Generate New Password
pt: Gerar Nova Senha

# dealershipAutonomyEmpty
source: Please select an Autonomy Level
pt: Por favor selecione um nível de autonomia

# dealershipEdit
source: Edit
pt: Editar

# dealershipRegister
source: Register
pt: Registrar

# dealershipAlertMessage
source: Do you really want to deactivate this dealership?
pt: Você realmente quer desativar essa loja?

# dealershipDeactivate
source: Deactivate Dealership
pt: Desativar Loja

# dealershipListTitle
source: Here are all the Dealerships:
pt: Aqui estão todas as lojas:

# autonomyListTitle
source: Here are all the Autonomys:
pt: Aqui estão todas as autonomias:

# autonomyDealershipPercentage
source: Dealership {percentage}
pt: Loja {percentage}%

# autonomyEdit
source: Edit Contribuition
pt: Editar Contribuição

# dealershipPercentageHeader
source: Dealership %:
pt: Loja %:

# headquartersPercentageHeader
source: Headquarters %:
pt: Rede %:

# saveButton
source: Save
pt: Salvar

# saleListTitle
source: Here's a list of all the sales
pt: Aqui está a lista de todas as vendas

# saleListSubtitle
source: You can view and mark them as not concluded
pt: Você pode marca-las como não concluídas

# saleListEmpty
source: There are no sales on this date
pt: Não há vendas nessa data

# saleAlertTitle
source: Are you sure you want to deactivate this sale?
pt: Tem certeza de que quer não concluir essa venda?

# saleAlertMessage
source: This can't be undone.
pt: Isso não pode ser desfeito.

# reportScreenTitle
source: Generate Sales Report
pt: Gerar Relatório de Vendas

# reportScreenSubtitle
source: Export a PDF file and save to your device.
pt: Exporte um arquivo PDF e salve no seu dispositivo.

# dateRangeHeader
source: Date Range
pt: Data

# pdfGenerateButton
source: Generate
pt: Gerar

# pdfTitle
source: SALES REPORT
pt: RELATÓRIO DE VENDAS

# pdfCustomer
source: Customer
pt: Cliente

# pdfSaleDate
source: Sale Date
pt: Data de Venda

# pdfDealershipPercentage
source: Dealership %
pt: Loja %

# pdfHeadquartersPercentage
source: Headquarters %
pt: Rede %

# pdfDealershipAmount
source: Total Dealership Amount:
pt: Quantia total da loja:

# pdfHeadquartersAmount
source: Total Headquarters Amount:
pt: Quantia total da rede:

# pdfTotalAmount
source: Total Amount:
pt: Quantia total:

# userRegisterTitle
source: Have a new associate?
pt: Tem um novo associado?

# userRegisterSubtitle
source: Please fill these fields
pt: Preencha os campos

# userEditTitle
source: Edit Existing User
pt: Editar Usuário Existente

# userFullNameHeader
source: Full Name
pt: Nome Completo

# userUsernameHeader
source: Username
pt: Nome de Usuário

# userDealershipHeader
source: Dealership
pt: Loja

# userRoleHeader
source: Role
pt: Papel

# userFullNameHint
source: Associate's full name
pt: Nome completo do associado

# userFullNameEmpty
source: Please type the associate's name
pt: Por favor digite o nome do associado

# userFullNameLength
source: Name should be at least 3 letters long
pt: O nome precisa ter pelo menos 3 caracteres

# userUsernameHint
source: Associate's username
pt: Nome de usuário do associado

# userUsernameEmpty
source: Please write a username
pt: Por favor digite um nome de usuário

# userUsernameLength
source: Username should be at least 4 letters long
pt: Nome de usuário precisa ter pelo menos 4 caracteres

# userDealershipEmpty
source: Please select a Dealership
pt: Por favor selecione uma loja

# userRoleEmpty
source: Please select a Role
pt: Por favor selecione um papel

# userRegisterButton
source: Register Associate
pt: Registrar Associado

# userUpdateButton
source: Update associate's info
pt: Atualizar Informações

# userAlertMessage
source: Do you really want to deactivate this user?
pt: Você realmente quer desativar esse usuário?

# userDeactivate
source: Deactivate User
pt: Desativar Usuário

# userListTitle
source: Here are all the associates:
pt: Aqui estão todos os associados:
